tap "heroku/brew"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/cask"
cask "caskroom/versions/java8"
brew "ack"
brew "autoconf"
brew "bcrypt"
brew "cmake"
brew "cscope"
brew "elasticsearch"
brew "elasticsearch@5.6", restart_service: true
brew "libpng"
brew "freetype"
brew "git"
brew "git-crypt"
brew "jpeg"
brew "libtiff"
brew "xz"
brew "imagemagick"
brew "macvim", args: ["with-override-system-vim"]
brew "mysql"
brew "nodenv"
brew "pcre"
brew "phantomjs"
brew "postgresql"
brew "qt", link: true
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "the_silver_searcher"
brew "tig"
brew "tmux", args: ["HEAD"]
brew "tree"
brew "yarn"
brew "heroku/brew/heroku"
