cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

# ===============================================
# Development
# ===============================================

# *Nix Tools

brew 'coreutils'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'cscope'
brew 'libpng'
brew 'freetype'
brew 'jpeg'
brew 'libtiff'
brew 'xz'
brew 'imagemagick'
brew 'pcre'
brew 'qt', link: true
brew 'wget'

brew 'bcrypt'
brew 'ack'
brew 'git'
brew 'git-crypt'
brew 'tig'
brew 'neovim'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tmux', args: ['HEAD']
brew 'fzf'
brew 'tree'
brew 'reattach-to-user-namespace'

# Deployment / Management Tools

brew 'rbenv'
brew 'nodenv'
brew 'yarn'
brew 'heroku/brew/heroku'

# Databases

brew 'redis', restart_service: true
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'elasticsearch', restart_service: true

# ===============================================
# Applications
# ===============================================

cask '1password'
cask 'iterm2'
cask 'vlc'
cask 'slack'
cask 'alfred'
cask 'sequel-pro'
cask 'postman'
cask 'dash'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'atom'
